app/views/lancamentos/_form.html.erb

    <%= f.label :user_id %><br>
    <%= f.collection_select(:user_id, User.all, :id, :nome)%>
---
SELECT `users`.* FROM `users`