app/views/lancamentos/index.html.erb

    Responsável:
  <%= select_tag :id_user, options_from_collection_for_select(User.all, 'id', 'nome'), include_blank: true %>
---
SELECT `users`.* FROM `users` ORDER BY `users`.`id` ASC LIMIT 1