app/controllers/lancamentos_controller.rb

  def index

    @lancamentos = Lancamento.search(params[:id_user], params[:min_date], params[:max_date])
---
SELECT `users`.* FROM `users` ORDER BY `users`.`id` ASC LIMIT 1