app/controllers/lancamentos_controller.rb

  def index

    @lancamentos = Lancamento.search(params[:id_user], params[:min_date], params[:max_date]).page(params[:page]).per_page(5)
---
SELECT COUNT(*) FROM `lancamentos`
SELECT `lancamentos`.* FROM `lancamentos` WHERE (user_id = '1') AND (data >= '2013-12-17') LIMIT 5 OFFSET 0
SELECT `users`.* FROM `users`

  def create
    @lancamento = Lancamento.new(lancamento_params)

    respond_to do |format|
      if @lancamento.save
---
INSERT INTO `lancamentos` (`created_at`, `data`, `descricao`, `updated_at`, `user_id`, `valor`) VALUES ('2013-12-14 06:34:25', '2013-12-14', 'Jogos ', '2013-12-14 06:34:25', 1, 85)

  def update
    respond_to do |format|
      if @lancamento.update(lancamento_params)
---
UPDATE `lancamentos` SET `valor` = 23, `updated_at` = '2013-12-15 01:22:47' WHERE `lancamentos`.`id` = 5

  def destroy
    @lancamento.destroy
---
DELETE FROM `lancamentos` WHERE `lancamentos`.`id` = 1

    def set_lancamento
      @lancamento = Lancamento.find(params[:id])
---
SELECT `lancamentos`.* FROM `lancamentos` WHERE `lancamentos`.`id` = 5 LIMIT 1