app/controllers/users_controller.rb

SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` LIMIT 5 OFFSET 0
---
  def index
    @users = User.all.page(params[:page]).per_page(5)

INSERT INTO `users` (`created_at`, `email`, `nome`, `updated_at`) VALUES ('2013-12-14 06:20:21', 'marcelo.mpinheiro96@gmail.com', 'Marcelo Augusto Marques Pinheiro', '2013-12-14 06:20:21')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save